app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM `recipes`

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 1)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 2)

  def create
    @recipe = Recipe.new(params[:recipe])
    Time.now

    respond_to do |format|
      if @recipe.save
---
INSERT INTO `recipes` (`updated_at`, `title`, `author`, `description`, `created_at`) VALUES('2009-07-31 20:55:35', 'Product', 'Lorenz', 'This is good', '2009-07-31 20:55:35')

  def update
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 2)