app/controllers/tags_controller.rb

SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.taggable_type = 'Recipe') AND (`taggings`.taggable_id = 1))
---
  def show
    @recipes = Recipe.find_tagged_with(params[:id])